openwsn-berkeley/openwsn-fw/bsp/boards/nrf52840dk/sdk/components/libraries/cli/nrf_cli.c
        switch (p_cli->p_ctx->receive_state)
        {
            case NRF_CLI_RECEIVE_DEFAULT:
                if (data == p_cli->newline_char)
                {
                    if (p_cli->p_ctx->cmd_buff_len == 0)
                    {
                        cursor_next_line_move(p_cli);
                    }
                    else
                    {
                        /* Command execution */
                        cli_execute(p_cli);
                    }
                    cli_state_set(p_cli, NRF_CLI_STATE_ACTIVE);
                    return;
                }
                switch (data)
                {
                    case NRF_CLI_VT100_ASCII_ESC:       /* ESCAPE */
                        recieve_state_change(p_cli, NRF_CLI_RECEIVE_ESC);
                        break;
                    case '\0':
                        break;
                    case '\t':                          /* TAB */
                        if (cli_flag_echo_is_set(p_cli))
                        {
                            cli_tab_handle(p_cli);
                        }
                        break;
                    case NRF_CLI_VT100_ASCII_BSPACE:    /* BACKSPACE */
                        if (cli_flag_echo_is_set(p_cli))
                        {
                            char_backspace(p_cli);
                        }
                        break;
                    case NRF_CLI_VT100_ASCII_DEL:       /* DELETE */
                        if (cli_flag_echo_is_set(p_cli))
                        {
                            char_delete(p_cli);
                        }
                        break;
                    default:
                        if (isprint((int)data))
                        {
                            if (cli_flag_echo_is_set(p_cli))
                            {
                                char_insert(p_cli, data);
                            }
                            else
                            {
                                char_insert_echo_off(p_cli, data);
                            }
                        }
                        break;
                }
                break;
            case NRF_CLI_RECEIVE_ESC:
                if (data == '[')
                {
                    recieve_state_change(p_cli, NRF_CLI_RECEIVE_ESC_SEQ);
                }
                else
                {
                    recieve_state_change(p_cli, NRF_CLI_RECEIVE_DEFAULT);
                }
                break;
            case NRF_CLI_RECEIVE_ESC_SEQ:
                recieve_state_change(p_cli, NRF_CLI_RECEIVE_DEFAULT);

                if (!cli_flag_echo_is_set(p_cli))
                {
                    return;
                }

                switch (data)
                {
#if NRF_MODULE_ENABLED(NRF_CLI_HISTORY)
                    case 'A': /* UP arrow */
                        history_handle(p_cli, true);
                        break;
                    case 'B': /* DOWN arrow */
                        history_handle(p_cli, false);
                        break;
#endif
                    case 'C': /* RIGHT arrow */
                        right_arrow_handle(p_cli);
                        break;
                    case 'D': /* LEFT arrow */
                        left_arrow_handle(p_cli);
                        break;
                    case 'F': /* END Button */
                        cursor_end_position_move(p_cli);
                        break;
                    case 'H': /* HOME Button */
                        cursor_home_position_move(p_cli);
                        break;
                    case 'L': /* INSERT Button */
                        p_cli->p_ctx->internal.flag.insert_mode ^= 1;
                        break;
                    default:
                        break;
                }
                break;
            default:
                recieve_state_change(p_cli, NRF_CLI_RECEIVE_DEFAULT);
                break;
        }
    }
}

/* Function remove white chars from beginning and end of command buffer. */
static void cmd_trim(nrf_cli_t const * p_cli)
{
    nrf_cli_cmd_len_t i = 0;

    if (p_cli->p_ctx->cmd_buff[0] == '\0') /* no command in the buffer */
    {
        return;
    }

    /* Counting white characters starting from beginning of the command. */
    while (isspace((int)p_cli->p_ctx->cmd_buff[i++]))
    {
        if (i == 0)
        {
            p_cli->p_ctx->cmd_buff[0] = '\0';
            return;
        }
    }

    /* Removing counted white characters. */
    if (--i > 0)
    {
        memmove(p_cli->p_ctx->cmd_buff,
                p_cli->p_ctx->cmd_buff + i,
                (p_cli->p_ctx->cmd_buff_len + 1) - i); /* +1 for '\0' */
        p_cli->p_ctx->cmd_buff_len = p_cli->p_ctx->cmd_buff_len - i;
        p_cli->p_ctx->cmd_buff_pos = p_cli->p_ctx->cmd_buff_len;
    }

    /* Counting white characters starting from end of command. */
    char * p_end = &p_cli->p_ctx->cmd_buff[p_cli->p_ctx->cmd_buff_len - 1];
    i = 0;
    while (isspace((int)*p_end))
    {
        ++i;
        --p_end;
    }

    /* Removing counted white characters. */
    if (p_end != &p_cli->p_ctx->cmd_buff[p_cli->p_ctx->cmd_buff_len - 1])
    {
        p_cli->p_ctx->cmd_buff[p_cli->p_ctx->cmd_buff_len - i] = '\0';
        p_cli->p_ctx->cmd_buff_len = p_cli->p_ctx->cmd_buff_len - i;
        p_cli->p_ctx->cmd_buff_pos = p_cli->p_ctx->cmd_buff_len;
    }
}

#if NRF_MODULE_ENABLED(NRF_CLI_WILDCARD)
static void spaces_trim(char * p_char)
{
    nrf_cli_cmd_len_t shift = 0;
    nrf_cli_cmd_len_t len = cli_strlen(p_char);

    if (p_char == NULL)
    {
        return;
    }

    for (nrf_cli_cmd_len_t i = 0; i < len - 1; i++)
    {
        if (isspace((int)p_char[i]))
        {
            for (nrf_cli_cmd_len_t j = i + 1; j < len; j++)
            {
                if (isspace((int)p_char[j]))
                {
                    shift++;
                    continue;
                }
                if (shift > 0)
                {
                    memmove(&p_char[i + 1], &p_char[j], len - shift + 1); // +1 for EOS
                    len -= shift;
                    shift = 0;
                }
                break;
            }
        }
    }
}

/* Adds new command and one space just before pattern */
static bool command_to_tmp_buffer_add(nrf_cli_t const * p_cli,
                                      char const *      p_new_cmd,
                                      char const *      p_pattern)
{
    nrf_cli_cmd_len_t cmd_len = cli_strlen(p_new_cmd);
    nrf_cli_cmd_len_t shift;
    char *            p_cmd_source_addr;

    /* +1 for space */
    if (((size_t)p_cli->p_ctx->cmd_tmp_buff_len + cmd_len + 1) > NRF_CLI_CMD_BUFF_SIZE)
    {
        nrf_cli_fprintf(p_cli,
                        NRF_CLI_WARNING,
                        "Command buffer is too short to expand all commands matching "
                        "wildcard pattern\r\n");
        return false;
    }

    p_cmd_source_addr = strstr(p_cli->p_ctx->temp_buff, p_pattern);

    if (p_cmd_source_addr == NULL)
    {
        return false;
    }

    shift = cli_strlen(p_cmd_source_addr);

    /* make place for new command:      + 1 for space                 + 1 for EOS */
    memmove(p_cmd_source_addr + cmd_len + 1, p_cmd_source_addr, shift + 1);
    memcpy(p_cmd_source_addr, p_new_cmd, cmd_len);
    p_cmd_source_addr[cmd_len] = ' ';

    p_cli->p_ctx->cmd_tmp_buff_len += cmd_len + 1; // + 1 for space

